app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT * FROM `blogs`

  def show
    @blog = Blog.find(params[:id])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 0)

  def edit
    @blog = Blog.find(params[:id])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 3)

  def create
    @blog = Blog.new(params[:blog])

    respond_to do |format|
      if @blog.save
---
INSERT INTO `blogs` (`project_id`, `updated_at`, `title`, `is_published`, `description`, `published_date`, `created_at`) VALUES(NULL, '2009-10-02 10:19:17', 'test blog title', 1, 'test blog description', '2009-10-02 10:18:00', '2009-10-02 10:19:17')

  def update
    @blog = Blog.find(params[:id])

    respond_to do |format|
      if @blog.update_attributes(params[:blog])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 3)
UPDATE `blogs` SET `description` = 'апрапрапр', `updated_at` = '2009-10-02 10:46:46' WHERE `id` = 3

  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 1)
DELETE FROM `blogs` WHERE `id` = 1