app/controllers/clients_controller.rb

SELECT * FROM `clients` WHERE (`clients`.`id` = 18)
SELECT * FROM `clients`
---
  def edit_client_form
   respond_to do |format|
   format.js do
     @client = Client.find(params[:id])
     if @client and !@clients.blank?

SELECT * FROM `clients` WHERE (`clients`.`id` = 8)
---
  def update
    @client = Client.find(params[:id])

SELECT * FROM `mrcs` WHERE (`mrcs`.`id` = 1)
SELECT * FROM `clients` WHERE (`clients`.mrc_id = 1)
---
  def show_clients
    respond_to do |format|
     format.js do
      @mrc = Mrc.find(params[:id])
      if @mrc
         @mrc_clients = @mrc.clients
        if !@mrc_clients.blank? and !@clients.blank?