app/controllers/mrcs_controller.rb

SELECT * FROM `mrcs`
---
  def index
#    @mrc = Mrc.new
#    @user_action = 'new'
    @mrcs = Mrc.all #FIXME: !!!