app/controllers/projects_controller.rb

SELECT * FROM `clients` WHERE (`clients`.`id` = 2)
SELECT * FROM `projects` WHERE (`projects`.client_id = 2)
---
  def show_projects
   respond_to do |format|
	  format.js do
			@client = Client.find(params[:id])
			if @client
			  @client_projects = @client.projects
				  if !@client_projects.blank? and !@projects.blank?

SELECT * FROM `mrcs` WHERE (`mrcs`.`id` = 1)
---
 def show_clients
    respond_to do |format|
	   format.js do
			@mrc = Mrc.find(params[:id])