app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 23) LIMIT 1
UPDATE `users` SET `last_name` = 'Admin', `first_name` = 'Root', `updated_at` = '2009-10-05 13:31:05' WHERE `id` = 23
SELECT * FROM `users`
---
   def update
   @user = User.find(params[:id])
   @user.level  = 'user' if @user
    respond_to do |format|
      format.js do
       if @user.update_attributes(params[:user])
          @user.ownerships.each {|o| o.destroy}